### Trabalhando com Planilhas do Excel

In [1]:
#Importando a biblioteca
import pandas as pd

**Instalando a biblioteca Openpyxl**

In [4]:
pip install openpyxl

Requirement already satisfied: openpyxl in c:\users\luciu\appdata\local\programs\python\python38\lib\site-packages (3.0.7)Note: you may need to restart the kernel to use updated packages.
Requirement already satisfied: et-xmlfile in c:\users\luciu\appdata\local\programs\python\python38\lib\site-packages (from openpyxl) (1.1.0)

[notice] A new release of pip available: 22.1.2 -> 22.2.2
[notice] To update, run: c:\users\luciu\appdata\local\programs\python\python38\python.exe -m pip install --upgrade pip

**Fazendo a leitura dos arquivos passando a engine escolhida**

In [7]:
#Leitura dos arquivos
df1 = pd.read_excel("datasets/Aracaju.xlsx", engine = 'openpyxl')
df2 = pd.read_excel("datasets/Fortaleza.xlsx", engine = 'openpyxl')
df3 = pd.read_excel("datasets/Natal.xlsx", engine = 'openpyxl')
df4 = pd.read_excel("datasets/Recife.xlsx", engine = 'openpyxl')
df5 = pd.read_excel("datasets/Salvador.xlsx", engine = 'openpyxl')

In [9]:
df5.head()

     Cidade       Data  Vendas  LojaID  Qtde
0  Salvador 2018-01-01   31.06    1037     3
1  Salvador 2018-01-01   19.02    1034     3
2  Salvador 2019-02-10  173.59    1035     3
3  Salvador 2019-02-10  176.34    1037     3
4  Salvador 2019-02-14   19.47    1037     3

In [10]:
#juntando todos os arquivos
df = pd.concat([df1,df2,df3,df4,df5])

In [11]:
#Exibindo as 5 primeiras linhas
df.head()

    Cidade       Data  Vendas  LojaID  Qtde
0  Aracaju 2018-01-01  142.00    1520     1
1  Aracaju 2018-01-01   14.21    1522     6
2  Aracaju 2018-01-01   71.55    1520     1
3  Aracaju 2018-01-01    3.01    1521     7
4  Aracaju 2018-01-01   24.51    1522     8

In [12]:
#Exibindo as 5 últimas linhas
df.tail()

       Cidade       Data  Vendas  LojaID  Qtde
235  Salvador 2019-01-03   41.84    1034     1
236  Salvador 2019-01-03  126.29    1035     3
237  Salvador 2019-01-03   38.06    1036     3
238  Salvador 2019-01-03  139.64    1035     1
239  Salvador 2019-01-03  161.41    1037     3

In [13]:
#Pegando uma amostra do data frame
df.sample(5)

        Cidade       Data  Vendas  LojaID  Qtde
33   Fortaleza 2019-01-01   19.56    1005     1
218   Salvador 2019-01-02  189.12    1036     3
86       Natal 2019-01-02  156.47    1037     3
181      Natal 2019-01-02  244.83    1037     2
195      Natal 2019-01-02   44.89    1036     3

In [14]:
#Verificando o tipo de dado de cada coluna
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID             int64
Qtde               int64
dtype: object

**Tratando valores missing**

In [15]:
#Consultando linhas com valores faltantes
df.isnull().sum()

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

**Criando colunas novas**

In [16]:
#Criando a coluna de receita
df["Receita"] = df["Vendas"].mul(df["Qtde"])

In [17]:
df.head()

    Cidade       Data  Vendas  LojaID  Qtde  Receita
0  Aracaju 2018-01-01  142.00    1520     1   142.00
1  Aracaju 2018-01-01   14.21    1522     6    85.26
2  Aracaju 2018-01-01   71.55    1520     1    71.55
3  Aracaju 2018-01-01    3.01    1521     7    21.07
4  Aracaju 2018-01-01   24.51    1522     8   196.08

In [27]:
#Retornando a maior receita
df["Receita"].max()

3544.0

In [28]:
#Retornando a menor receita
df["Receita"].min()

3.34

In [29]:
#nlargest (retornando as 3 maiores receitas)
df.nlargest(3, "Receita")

   Cidade       Data  Vendas  LojaID  Qtde  Receita
7   Natal 2019-03-18   886.0     853     4   3544.0
51  Natal 2018-01-21   859.0     852     4   3436.0
55  Natal 2019-01-08   859.0     854     4   3436.0

In [30]:
#nsamllest (retornando as 3 menores receitas)
df.nsmallest(3, "Receita")

      Cidade       Data  Vendas  LojaID  Qtde  Receita
118  Aracaju 2018-01-01    3.34    1522     1     3.34
65    Recife 2019-01-01    4.01     981     1     4.01
92     Natal 2019-01-02    4.57    1035     1     4.57

**Usando o Groupby**

In [32]:
#Agrupamento por cidade
df.groupby("Cidade")["Receita"].sum()

Cidade
Aracaju       48748.25
Fortaleza     37913.97
Natal        167227.52
Recife        51936.51
Salvador      40596.73
Name: Receita, dtype: float64

In [33]:
#Ordenando o conjunto de dados
df.sort_values("Receita", ascending=False).head(10)

   Cidade       Data  Vendas  LojaID  Qtde  Receita
7   Natal 2019-03-18   886.0     853     4   3544.0
55  Natal 2019-01-08   859.0     854     4   3436.0
51  Natal 2018-01-21   859.0     852     4   3436.0
30  Natal 2018-10-02   856.0     853     4   3424.0
41  Natal 2018-05-20   835.0     852     4   3340.0
38  Natal 2018-02-25   828.0     852     4   3312.0
10  Natal 2018-10-27   828.0     852     4   3312.0
69  Natal 2019-03-24   817.0     852     4   3268.0
62  Natal 2018-02-10   793.0     854     4   3172.0
52  Natal 2018-04-27   778.0     854     4   3112.0

**Trabalhando com datas**

In [34]:
#Trasnformando a coluna de data em tipo inteiro
df["Data"] = df["Data"].astype("int64")

In [35]:
#Verificando o tipo de dado de cada coluna
df.dtypes

Cidade      object
Data         int64
Vendas     float64
LojaID       int64
Qtde         int64
Receita    float64
dtype: object

In [36]:
#Transformando coluna de data em data
df["Data"] = pd.to_datetime(df["Data"])

In [129]:
df.dtypes

Cidade                    object
Data              datetime64[ns]
Vendas                   float64
LojaID                    object
Qtde                       int64
Receita                  float64
Receita/Vendas           float64
dtype: object

In [37]:
#Agrupamento por ano
df.groupby(df["Data"].dt.year)["Receita"].sum()

Data
2018    118176.53
2019    228246.45
Name: Receita, dtype: float64

In [38]:
#Criando uma nova coluna com o ano
df["Ano_Venda"] = df["Data"].dt.year

In [39]:
df.sample(5)

       Cidade       Data  Vendas  LojaID  Qtde  Receita  Ano_Venda
15   Salvador 2019-01-01   20.15    1036     3    60.45       2019
91    Aracaju 2018-01-01  200.85    1522     6  1205.10       2018
58      Natal 2018-12-23  272.00     853     3   816.00       2018
139     Natal 2019-01-02  169.01    1036     1   169.01       2019
27   Salvador 2019-01-01  145.79    1034     1   145.79       2019

In [40]:
#Extraindo o mês e o dia
df["mes_venda"], df["dia_venda"] = (df["Data"].dt.month, df["Data"].dt.day)

In [41]:
df.sample(5)

,Cidade,Data,Vendas,LojaID,Qtde,Receita,Ano_Venda,mes_venda,dia_venda
133,Recife,2019-03-02,14.67,980,7,102.69,2019,3,2
96,Salvador,2019-01-01,42.94,1034,3,128.82,2019,1,1
109,Salvador,2019-03-02,124.37,1035,1,124.37,2019,3,2
55,Salvador,2019-01-01,36.62,1036,1,36.62,2019,1,1
0,Salvador,2018-01-01,31.06,1037,3,93.18,2018,1,1

In [42]:
#Retornando a data mais antiga
df["Data"].min()

Timestamp('2018-01-01 00:00:00')

In [43]:
#Calculando a diferença de dias
df["diferenca_dias"] = df["Data"] - df["Data"].min()

In [44]:
df.sample(5)

,Cidade,Data,Vendas,LojaID,Qtde,Receita,Ano_Venda,mes_venda,dia_venda,diferenca_dias
74,Salvador,2019-01-01,170.53,1035,2,341.06,2019,1,1,365 days
33,Recife,2019-01-01,32.33,982,1,32.33,2019,1,1,365 days
40,Fortaleza,2019-02-13,19.13,1002,4,76.52,2019,2,13,408 days
48,Recife,2019-01-01,141.19,980,7,988.33,2019,1,1,365 days
21,Aracaju,2018-01-01,37.36,1520,2,74.72,2018,1,1,0 days

In [45]:
#Criando a coluna de trimestre
df["trimestre_venda"] = df["Data"].dt.quarter

In [46]:
df.sample(5)

,Cidade,Data,Vendas,LojaID,Qtde,Receita,Ano_Venda,mes_venda,dia_venda,diferenca_dias,trimestre_venda
119,Fortaleza,2019-03-02,152.30,982,7,1066.10,2019,3,2,425 days,1
213,Salvador,2019-01-02,42.12,1035,1,42.12,2019,1,2,366 days,1
89,Natal,2019-01-02,17.46,1034,1,17.46,2019,1,2,366 days,1
111,Salvador,2019-03-02,147.35,1037,2,294.70,2019,3,2,425 days,1
103,Recife,2019-01-01,41.65,982,3,124.95,2019,1,1,365 days,1

In [57]:
#Filtrando as vendas de 2019 do mês de março
vendas_marco_19 = df.loc[(df["Data"].dt.year == 2019) & (df["Data"].dt.month == 3)]

In [58]:
vendas_marco_19.sample(20)

,Cidade,Data,Vendas,LojaID,Qtde,Receita,Ano_Venda,mes_venda,dia_venda,diferenca_dias,trimestre_venda
128,Fortaleza,2019-03-02,38.70,982,4,154.80,2019,3,2,425 days,1
124,Fortaleza,2019-03-02,47.98,983,7,335.86,2019,3,2,425 days,1
141,Recife,2019-03-02,182.75,983,8,1462.00,2019,3,2,425 days,1
131,Recife,2019-03-02,139.07,982,6,834.42,2019,3,2,425 days,1
137,Recife,2019-03-02,51.99,983,3,155.97,2019,3,2,425 days,1
29,Natal,2019-03-09,646.00,854,2,1292.00,2019,3,9,432 days,1
127,Recife,2019-03-02,39.56,982,8,316.48,2019,3,2,425 days,1
136,Recife,2019-03-02,39.09,982,4,156.36,2019,3,2,425 days,1
113,Recife,2019-03-02,38.63,980,2,77.26,2019,3,2,425 days,1
74,Natal,2019-03-10,303.00,854,3,909.00,2019,3,10,433 days,1
117,Salvador,2019-03-02,39.41,1034,1,39.41,2019,3,2,425 days,1
133,Salvador,2019-03-02,153.71,1035,1,153.71,2019,3,2,425 days,1
109,Fortaleza,2019-03-02,18.90,982,6,113.40,2019,3,2,425 days,1
123,Salvador,2019-03-02,127.45,1036,3,382.35,2019,3,2,425 days,1
129,Recife,2019-03-02,35.34,982,7,247.38,2019,3,2,425 days,1
112,Fortaleza,2019-03-02,133.59,982,1,133.59,2019,3,2,425 days,1
75,Natal,2019-03-30,706.00,854,2,1412.00,2019,3,30,453 days,1
121,Salvador,2019-03-02,100.70,1037,3,302.10,2019,3,2,425 days,1
134,Fortaleza,2019-03-02,195.18,980,5,975.90,2019,3,2,425 days,1
8,Natal,2019-03-27,667.00,852,4,2668.00,2019,3,27,450 days,1